# PathReinSpanlengthBarlengthPrim Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinSpanlengthBarlengthPrim Property
ParameterTypeId Class See Also
---
"Length (Primary Bar)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinSpanlengthBarlengthPrim { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinSpanlengthBarlengthPrim As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinSpanlengthBarlengthPrim {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace